from operations import load_users, check_balance, deposit, withdraw

print('''\n========= ბანკომატი! ==========''')
users = load_users()

while True:
        #მომხმარებლისა და პაროლის შეყვანა
        print('''\n-------- ავტორიზაცია --------''')
        username = input("\nშეიყვანეთ მომხმარებლის სახელი: ")
        pin = input("\nშეიყვანეთ PIN კოდი: ")
        #შეყვანილი მონაცემების შემოწმება არის თუ არა ბაზაში(ფაილში)
        if username in users and users[username]['pin'] == pin:
            print(f"\nგამარჯობა, {username}!")
            while True:
                               
                choice = input('''\nაირჩიეთ ოპერაცია:
                               
            1. 💰 ბალანსის შემოწმება
            2. 📥 თანხის შეტანა
            3. 📤 თანხის გატანა
            4. 🔒 გამოსვლა               

თქვენი არჩევანი (1-4): ''')

                if choice == '1':
                    check_balance(users, username)
                elif choice == '2':
                    deposit(users, username)
                elif choice == '3':
                    withdraw(users, username)
                elif choice == '4':
                    print("სისტემიდან გასვლა.")
                    break
                else:
                    print("❌ არასწორი არჩევანი, სცადეთ თავიდან.")
        else:
            print("❌ შეცდომა: მომხმარებლის სახელი ან PIN კოდი არასწორია.")
            
        retry = input("\nგსურთ სხვა მომხმარებლით შესვლა? (კი/არა): ")
        if retry.lower() != 'კი':
            print("🔒 ოპერაციის დასასრული.")
            break